<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
	"http://www.w3.org/TR/html4/loose.dtd">

<html>
  <head>
    <title></title>
    <link href="default.css" rel="stylesheet" type="text/css">
  </head>
  <body>
    <div id="header">
      <img src="consistec_logo.jpg" alt="consistec Logo"/>
      <hr />
      Herzlich willkommen zum ProFit 2.0 Workshop "Versionierung intensiv"!
    </div>
    <div id="Gruppenlinks">
      <!-- Gruppe 1: bitte fügen Sie hier einen Link auf Ihre Gruppen-Seite ein; z.B. <a href="Gruppe1.html">Gruppe 1</a> -->
    </div>
    <div id="intro">
      <br>
      <b>Gl&uuml;ckwunsch, den ersten Schritt haben Sie gemeistert!</b>
      <br>
      <br>
      Da Sie diese Zeilen lesen k&ouml;nnen, haben Sie das git Repository dieses Workshops erfolgreich gecloned. Wie Sie bereits gelernt haben, befindet sich damit nun die gesamte History des Repositories bei ihnen lokal auf dem USB-Stick und der Branch "master" wurde bereits ausgecheckt. Nun geht es mit folgenden Schritten weiter...
      <br>
      <br>
      <h4>Allgemeine Hinweise</h4>
      <ul>
	<li>Auf dem USB-Stick finden Sie ein portable Version von Git, die Sie f&uuml;r die folgenden Aufgaben nutzen k&ouml;nnen</li>
	<li>F&uuml;r die Praxis&uuml;bung haben wir bei <a href="http://www.github.com">Github</a> einen gemeinsamen Account angelegt<br>
	  Username: profitdvcs<br>
	  Passwort: profit2.0
	</li>
	<li>In der Git-Shell bekommen Sie mittels <code>git Kommando --help</code> (z.B. <code>git commit --help</code>) Hilfe zu allen Git Kommandos</li>
	<li>In der Shell steht Ihnen f&uuml;r Git Kommandos Tab-Completion zur Verf&uuml;gung.</li>
	<li>Zus&auml;tzlich zum Zugriff &uuml;ber Git, k&ouml;nnen Sie unser Git-Repository auch auf Github im Browser anschauen: <a href="https://github.com/dirkl/ProFit-DVCS">hier</a></li>
	<li>Verschaffen Sie sich zwischendurch immer wieder einen &Uuml;berblick &uuml;ber das Repo, indem Sie in der Shell die GUI Tools <code>gitk --all</code> und <code>git gui</code> aufrufen.
      </ul>
      <br>
    </div>
    <div id="Vorarbeiten">
      <h4>Vorarbeiten</h4>
      <ul>
	<li>Starten Sie eine zun&auml;chst eine Git-Bash Shell f&uuml;r die weiteren Arbeiten durch Doppelklick auf <code>\Portable Git\git-bash.bat</code> auf dem USB-Stick</li>
	<li>Konfigurieren Sie in Git Ihren Nutzernamen, damit wir nachher Commits der Teilnehmer auseinander halten k&ouml;nnen
	  <ol>
	    <li><code>git config --global user.name "Max Mustermann"</code></li>
	    <li><code>git config --global user.email max@mustermann.de</code></li>
	  </ol>
	<li>Clonen Sie das Beispielrepository von Github
	  <ol>
	    <li><code>cd projects</code></li>
	    <li><code>git clone git@github.com:dirkl/ProFit-DVCS.git</code></li>
	    <li><code>cd ProFit-DVCS</code></li>
	  </ol>
	</li>
	<li>Den Rest dieser Datei finden Sie auch im gerade ausgecheckten Beispielrepository in der Datei <code>Readme.html</code>; &oumlffnen Sie diese mit einem Browser.</li>
      </ul>
    <div id="Anleitung">
      <h4>Praxis&uuml;bung</h4>
      <em>Ziel dieser Praxis&uuml;bung</em> ist, f&uuml;r Ihre Gruppe aus der Template-Datei <a href="Template.html"><code>Template.html</code></a> eine eigene HTML-Datei <code>GruppeX.html</code> zu erstellen, zum Repository in einem eigenen Branch hinzuzuf&uuml;gen und wieder in den Master-Branch zu integrieren.
      <ol>
	<li><b>Setzen Sie ein Feature um.</b>
	  <ol>
	    <li>Checken Sie den Master Branch aus
	      <ul>
		<li><code>git checkout master</code></li>
		<li>&Uuml;berpr&uuml;fen Sie das Ergebnis in der Kommandozeile (<code>git status</code>) und in Gitk</li>
	      </ul>
	    </li>
	    <li>Im Repository finden Sie nun zwei HTML-Dateien:
	      <ol>
		<li><code>Readme.html</code></li>
		<li><code>Template.html</code></li>
	      </ol>
	    </li>
	    <li>Erstellen Sie f&uuml;r Ihre Arbeiten zun&auml;chst einen neuen Branch <code>GruppeX</code>
	      <ul>
		<li><code>git branch GruppeX</code></li>
		<li>Wechseln Sie auf den neu erstellten Branch: <code>git checkout GruppeX</code></li>
		<li><em>Hinweis: </em>Sie k&ouml;nnen diese beiden Kommandos auch in einem Schritt ausf&uuml;hren: <code>git checkout -b GruppeX</code></li>
	      </ul>
	    </li>
	    <li>Erstellen Sie eine Kopie <code>GruppeX.html</code> von <code>Template.html</code> und f&uuml;gen Sie diese dem Repository hinzu
	      <ul>
		<li>Kopieren der Template Datei in Explorer oder Shell</li>
		<li>Aufnahme in den Index: <code>git add Dateiname</code> oder mittels <code>git gui</code>
		<li>Committen Sie den initialen Dateizustand</li>
	      </ul>
	    </li>
	    <li>Nehmen Sie &Auml;nderungen an Ihrer Datei vor
	      <ul>
		<li>Editieren Sie <code>GruppeX.html</code> (z.B. mit Notepad oder in der Shell)</li>
		<li>F&uuml;hren Sie die dort beschreibenen &Auml;nderungen durch.</li>
	      </ul>
	    </li>
	  </ol>
	</li>
	<li><b>Intermezzo: Hotfix</b>
	  <ul>
	    <li>Einf&uuml;hrung:
	      <ul>
		<li>
		  Wir m&ouml;chten an dieser Stelle den typischen Fall durchspielen, dass w&auml;hrend der Entwicklung eines Features ein kritischer Bug auftritt.<br>
		  Ihr Chef kommt aufgeregt ins Zimmer und berichtet, dass auf der unternehmenskritischen Webseite f&uuml;r den Workshop "Versionierung intensiv" das Firmenlogo fehlt.
		  Dieses Problem muss nat&uuml;rlich sofort gefixt werden und Ihre aktuelle Arbeit muss beiseite gelegt werden.
		</li>
		<li>&Uuml;berlegen Sie kurz, wie Sie das in Subversion umsetzen w&uuml;rden.</li>
		<li>In Git bietet sich f&uuml;r diese Situation die Nutzung des Stash an.<br>
		  Zur Erinnerung: auf dem Stash k&ouml;nnen Sie &Auml;nderungen ohne expliziten Commit ablegen (<code>git stash</code>) und sp&auml;ter wieder herstellen (<code>git stash pop</code>)</li>
	      </ul>
	    </li>
	    <li>Umsetzung
	      <ol>
      		<li>Packen Sie Ihre aktuellen &Auml;nderungen auf den Stash und schauen Sie sich die Situation in <code>gitk</code> an</li>
		<li>Checken Sie den Produktivbranch <code>online</code> aus, in dem der Fehler behoben werden muss: <code>git checkout online</code></li>
		<li>Beheben Sie in <code>index.html</code> den fehlerhaften Link auf die Grafik</li>
		<li>committen Sie Ihren Bugfix</li>
		<li><em>Achtung:</em> Normalerweise w&uuml;rden Sie an dieser Stelle den Bugfix auch in das zentrale Repository pushen. Das lassen wir in dieser &Uuml;bung weg, da es unvermeidlich zu Merge-Konflikten zwischen den einzelnen Gruppen k&auml;me (jede Gruppe behebt ja den gleichen Fehler).</li>
	      </ol>
	    </li>
	  </ul>
	<li><b>Weiter am Haupttask</b>
	  <ul>
	    <li>Der akute Fehler wurde behoben und Sie k&ouml;nnen sich wieder der urspr&uuml;nglichen Aufgabe zuwenden.
	      <ol>
		<li>Wechseln Sie zur&uuml;ck auf Ihren Branch: <code>git checkout GruppeX</code></li>
		<li>Sehen Sie sich die HTML-Datei im Editor an: Ihre gestashten &Auml;nderungen sind nicht enthalten</li>
		<li>Holen Sie die &Auml;nderungen vom Stash: <code>git stash pop</code></li>
		<li>Nun entspricht die HTML-Datei im Working-Directory wieder dem letzten Stand bevor Sie den Fehler beheben mussten</li>
		<li>Schlie&szlig;en Sie Ihre &Auml;nderungen ab und committen Sie (hinzuf&uuml;gen der &Auml;nderungen zum Index nicht vergessen!)</li>
	      </ol>
	    </li>
	    <li>Integrieren Sie nun Ihre &Auml;nderungen in den <code>master</code> Branch
	      <ol>
		<li>Wechseln Sie auf den master Branch (<code>git checkout master</code>)</li>
		<li>Integrieren Sie die &Auml;nderungen aus Ihrem Branch (<code>git merge GruppeX</code>)</li>
		<li>Schauen Sie sich das Ergebnis in <code>gitk</code> an</li>
	      </ol>
	    </li>
	    <li>Senden Sie Ihre Arbeit zum Github-Server
	      <ol>
		<li>Da auch die anderen Gruppen auf diesem Branch aktiv sind, sollten Sie zun&auml;chst Ihr Repository noch einmal mit dem Server synchronisieren
		  <ol>
		    <li>Beziehen Sie &Auml;nderungen vom Server: <code>git fetch</code></li>
		    <li>Falls es &Auml;nderungen gab, integrieren Sie diese mit Ihren &Auml;nderungen: <code>git merge origin/master</code></li>
		  </ol>
		</li>
		<li>Senden Sie Ihren Stand an den Server: <code>git push</code></li>   
	      </ol>
	    </li>
	  </ul>
	</li>
      </ol>
    </div>
    <div id="header">
      Geschafft! Sie haben damit die Aufgaben erfolgreich umgesetzt!
    </div>
  </body>
</html>

